[
  {
    "name": "Amban Sniper Rifle",
    "meta": "*Weapon (disruptor sniper), advanced (Requires Attunement)*",
    "desc": "You gain a +2 bonus to attack and damage rolls with this enhanced weapon. While looking through the scope at a spot you can see within 120 feet, you can both see and hear as if you were standing at that location.\n\nAdditionally, when you use this rifle as an\nimprovised weapon, you are considered proficient\nin it, it deals 1d6 kinetic damage on a hit, and it has\nthe shocking property with a DC of 16 and deals 1d8 lightning damage.\n\n*The rifle shoots solid slugs that will disintegrate a target on contact. The front of the rifle is double-pronged, and will act as a taser if necessary,\ndelivering a strong shock to opponents.*"
  },
  {
    "name": "Byrothsis Lightweapon",
    "meta": "*Weapon (any lightweapon), varies*",
    "desc": "**Adept (Prototype):** When this weapon is levitated by the Force to deal damage through a class feature or force power you use, it deals additional damage equal to the damage dice of the weapon.\n\n**Ancient (Legendary):** When this weapon is levitated by the Force to deal damage through a class feature or force power you use, it deals additional damage equal to twice the damage dice of the weapon."
  },
  {
    "name": "Byrothsis Novice Lightweapon",
    "meta": "Weapon (any lightweapon), standard (Requires Attunement)",
    "desc": "When this weapon is levitated by the Force to deal damage through a class feature or force power you use, it deals 1d4 additional damage of the same damage type as the feature levitating it."
  },
  {
    "name": "Chain Codes",
    "meta": "*Adventuring Gear: Data Recording and Storage*",
    "desc": "Chain Codes are obtained via Roleplay, participating in Arenas, going on Adventures or Shatterpoints. Shortened to CC.\n\nWith these Chain Codes you can use for multiple of things; \n* **Level Up!**\n* **Weapons and Languages!** Become proficient in a new Weapon or Language for 5 CC (unlimited)\n* **Skills and Tools!** Become proficient with a skill for 20 CC (4 times) and Expertise for 40 (2 times). Become proficien with a toolt for 10 CC (unlimited) and 20 for Expertise (3 times).\n* **Fighting Styles and Mastery!** Gain a Fighting Style for 10 CC (unlimited). Gain a Fighting Mastery for 20 (unlimited).\n* **ASI and Feats!** Increase your Ability Score for 50 CC (4 times). Gain a Feat for 100 CC (2 times).\n* **Retraining!** You can also spend CC to retrain a feature you've learned for another.\n\n\nYou can find the full breakdown in the [Market Cost Spreadsheet](https://docs.google.com/spreadsheets/d/1cTNxBozByX7-yjX5lqBRIHW3kZ7MI2k9mrblB8mHPzY/edit?usp=sharing)"
  },
  {
    "name": "Commlink, Enhanced",
    "meta": "*Adventuring Gear, (communications) Varies*",
    "desc": "**MK I (Standard):** When making Intelligence (Technology) checks with this enhanced comlink, your level of proficiency increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery). Additionally this comlink has a range of 60 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK II (Premium):** When making Intelligence (Technology) checks with this enhanced comlink, your level of proficiency by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery). Additionally this comlink has a range of 90 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK III (Prototype):** When making Intelligence (Technology) checks with this enhanced comlink, your level of proficiency increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this comlink has a range of 120 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK IV (Advanced):** When making Intelligence (Technology) checks with this enhanced comlink, your level of proficiency increases by four steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this comlink has a range of 150 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK V (Legendary):** When making Intelligence (Technology) checks with this enhanced comlink, your level of proficiency increases by five steps (to mastery, from trained to high mastery, or from proficient to grand mastery). Additionally this comlink has a range of 180 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK VI (Artifact):** When making Intelligence (Technology) checks with this enhanced comlink, you have grand mastery. Additionally this comlink has a range of 210 miles. The comlink lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell."
  },
  {
    "name": "Communication Jammer, Enhanced",
    "meta": "*Adventuring Gear, (communications) Varies*",
    "desc": "**MK I (Premium):** A device used to scramble and block transmissions from communications devices in a 600 foot radius. The device can be activated as an action. Any creature sending incoming or outgoing communications within range must succeed on a DC 18 Intelligence (Technology) check. On a failure their communications are jammed until the com jammer is turned off with an action or they move out of its range. The com jammer lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK II (Prototype):** A device used to scramble and block transmissions from communications devices in a 900 foot radius. The device can be activated as an action. Any creature sending incoming or outgoing communications within range must succeed on a DC 21 Intelligence (Technology) check. On a failure their communications are jammed until the com jammer is turned off with an action or they move out of its range. The com jammer lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK III (Advanced):** A device used to scramble and block transmissions from communications devices in a 1,200 foot radius. The device can be activated as an action. Any creature sending incoming or outgoing communications within range must succeed on a DC 24 Intelligence (Technology) check. On a failure their communications are jammed until the com jammer is turned off with an action or they move out of its range. The com jammer lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK IV (Legendary):** A device used to scramble and block transmissions from communications devices in a 1.500 foot radius. The device can be activated as an action. Any creature sending incoming or outgoing communications within range must succeed on a DC 27 Intelligence (Technology) check. On a failure their communications are jammed until the com jammer is turned off with an action or they move out of its range. The com jammer lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK V (Artifact):** A device used to scramble and block transmissions from communications devices in a 1,800 foot radius. The device can be activated as an action. Any creature sending incoming or outgoing communications within range must succeed on a DC 30 Intelligence (Technology) check. On a failure their communications are jammed until the com jammer is turned off with an action or they move out of its range. The com jammer lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell."
  },
  {
    "name": "Communication Scanner, Enhanced",
    "meta": "*Adventuring Gear, (communications) Varies*",
    "desc": "**MK I (Premium):** When making Intelligence (Technology) checks with this enhanced communication scanner, your level of proficiency increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery). Additonally this communication scanner has a range of 60 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK II (Premium):** When making Intelligence (Technology) checks with this enhanced communication scanner, your level of proficiency by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery). Additionally this communication scanner has a range of 90 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK III (Prototype):** When making Intelligence (Technology) checks with this enhanced communication scanner, your level of proficiency increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this communication scanner has a range of 120 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK IV (Advanced):** When making Intelligence (Technology) checks with this enhanced communication scanner, your level of proficiency increases by four steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this communication scanner has a range of 150 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK V (Legendary):** When making Intelligence (Technology) checks with this enhanced communication scanner, your level of proficiency increases by five steps (to mastery, from trained to high mastery, or from proficient to grand mastery). Additionally this communication scanner has a range of 180 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell.\n\n**MK VI (Artifact):** When making Intelligence (Technology) checks with this enhanced communication scanner, you have grand mastery. Additionally this communication scanner has a range of 210 miles. However, it cannot be used to intercept or locate the presence of comlinks using tightbeam transceivers unless the Communication Scanner is directly in the path of the signal. The com scanner lasts for 1 hour and can be recharged by connecting to a power source or by replacing the power cell."
  },
  {
    "name": "Communication Scrambler, Enhanced",
    "meta": "*Adventuring Gear, (communications) Varies*",
    "desc": "**MK I (Premium):** Over the course of one minute, you can attach a com scrambler to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more com scramblers together.\n\nThe com scrambler automatically encodes any outgoing message so that it can be read only by another communications device equipped with a linked com scrambler. Anyone who intercepts the scrambled message must succeed on a DC 18 Intelligence (Technology) check. On a failure the message is decrypted.\n\n**MK II (Prototype):** Over the course of one minute, you can attach a com scrambler to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more com scramblers together.\n\nThe com scrambler automatically encodes any outgoing message so that it can be read only by another communications device equipped with a linked com scrambler. Anyone who intercepts the scrambled message must succeed on a DC 21 Intelligence (Technology) check. On a failure the message is decrypted.\n\n**MK III (Advanced):** Over the course of one minute, you can attach a com scrambler to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more com scramblers together.\n\nThe com scrambler automatically encodes any outgoing message so that it can be read only by another communications device equipped with a linked com scrambler. Anyone who intercepts the scrambled message must succeed on a DC 24 Intelligence (Technology) check. On a failure the message is decrypted.\n\n**MK IV (Legendary):** Over the course of one minute, you can attach a com scrambler to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more com scramblers together.\n\nThe com scrambler automatically encodes any outgoing message so that it can be read only by another communications device equipped with a linked com scrambler. Anyone who intercepts the scrambled message must succeed on a DC 27 Intelligence (Technology) check. On a failure the message is decrypted.\n\n**MK V (Artifact):** Over the course of one minute, you can attach a com scrambler to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more com scramblers together.\n\nThe com scrambler automatically encodes any outgoing message so that it can be read only by another communications device equipped with a linked com scrambler. Anyone who intercepts the scrambled message must succeed on a DC 30 Intelligence (Technology) check. On a failure the message is decrypted."
  },
  {
    "name": "EE-3 Carbine Rifle",
    "meta": "*Weapon (carbine rifle), premium (Requires Attunement)*",
    "desc": "You gain a +1 bonus to attack and\ndamage rolls. While looking through the\nscope at a spot you can see within 120 feet,\nyou can both see and hear as if you were\nstanding at that location. Additionally, If you\nare proficient in this weapon, you can ignore\nthe two-handed property. If you do so, when\nyou make an attack with it, you forgo your\nproficiency bonus.\n\n*The EE-3 was an optically fitted carbine rifle\ncapable of three-round burst fire at long\nranges.*"
  },
  {
    "name": "Electro-Tattoo",
    "meta": "*Cybernetic (enhancement), standard*",
    "desc": "Using the ink of this specialized tattoo, you no longer require a tech focus to cast tech powers."
  },
  {
    "name": "Force-Imbued Blade",
    "meta": "*Weapon (any vibroweapon), prototype (Requires Attunement by a force-wielder)*",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this enhanced vibroweapon. Additionally this weapon gains the piercing 2 property.\n\nWhen the blade is first attuned to, the GM rolls a d4, this determines how the Force manifests itself and the type of extra damage it deals. On a 1 it deals Lightning damage. On a 2 it deals Necrotic damage. On a 3 it deals Fire damage. On a 4 it deals Force damage.\n\nYou can use a Bonus Action to channel the Force into this enhanced vibroweapon, causing it to glow with the Force. This glow sheds bright light in a 10-foot radius and dim light for an additional 10 feet.\n\nWhile the sword is glowing, it deals an extra 2d6 of damage, depending on the manifestation, to any target it hits.\nThe glow lasts until you use a Reaction to stop channeling the Force, or until you drop or sheathe the sword.\n\n*A solid metal blades that requires no power source, and glows with the power of the Force coursing through it. This glow manifests itself in multiple ways, ranging from lightning-like striations, a discolored blade, a blade wrapped in fire, or can lack any form of visuals at all.*"
  },
  {
    "name": "Glowrod, Focused",
    "meta": "",
    "desc": "Focused glowrods create a beam of light in a single direction, casting bright light in a 40-foot cone and dim light for an additional 40 feet. The glowrod lasts for 10 hours and can be recharged by connecting to a power source or by replacing the power cell."
  },
  {
    "name": "Grenade, Sleep",
    "meta": "*Adventuring Gear: (Explosives)*\n500 credits, 1.00 lb",
    "desc": "Roll 5d6; the total is how many hit points of creatures this grenade can affect. Each creature within 10 feet are affected in ascending order of their current hit points(ignoring unconscious creatures).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this grenade falls unconscious for 1 minute, the sleeper takes damage, or someone uses an action to shake the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected."
  },
  {
    "name": "Grenade, Smoke",
    "meta": "*Adventuring Gear: Explosives*\n50 credits, 1.00 lb",
    "desc": "The grenade explodes, filling the air in a 20-foot-radius sphere with smoke for 1 minute. The fog spreads around corners, and its area is heavily obscured. It lasts for 1 minute or until a wind of at least 10 miles per hour disperses it."
  },
  {
    "name": "Grenade, Stun (Errata)",
    "meta": "*Adventuring Gear: Explosives*\n500 credits, 1.00 lb",
    "desc": "Each creature within 10 feet must make a DC 14 Constitution saving throw. On a failed save, a creature is stunned until the end of their next turn."
  },
  {
    "name": "Hands-Free Commlink, Enhanced",
    "meta": "*Adventuring Gear, varies*",
    "desc": "**Basic (Standard):** When making Intelligence (Technology) checks with this enhanced commlink, your level of proficiency increases by one step (to trained, from trained to proficient, from proficient to expertise, from expertise to mastery, from mastery to high mastery, or from high mastery to grand mastery). Additionally this commlink has a range of 60 miles.\n\n**Fine (Premium):** When making Intelligence (Technology) checks with this enhanced commlink, your level of proficiency by two steps (to proficient, from trained to expertise, from proficient to mastery, from expertise to high mastery, or from mastery to grand mastery). Additionally this commlink has a range of 90 miles.\n\n**Improved (Prototype):** When making Intelligence (Technology) checks with this enhanced commlink, your level of proficiency increases by three steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this commlink has a range of 120 miles.\n\n**Superior (Advanced):** When making Intelligence (Technology) checks with this enhanced commlink, your level of proficiency increases by four steps (to expertise, from trained to mastery, from proficient to high mastery, or from expertise to grand mastery). Additionally this commlink has a range of 150 miles.\n\n**Exceptional (Legendary):** When making Intelligence (Technology) checks with this enhanced commlink, your level of proficiency increases by five steps (to mastery, from trained to high mastery, or from proficient to grand mastery). Additionally this commlink has a range of 180 miles.\n\n**Champion (Artifact):** When making Intelligence (Technology) checks with this enhanced commlink, you have grand mastery. Additionally this commlink has a range of 210 miles."
  },
  {
    "name": "Heart of the Guardian",
    "meta": "*Item modification (lightweapon), artifact*",
    "desc": "While using this item as your focus, you gain a +2 bonus to melee and ranged force attacks.\n\nOnce a subject of both Jedi and Sith prophecy, the Heart of the Guardian is one of two legendary Lightsaber Crystals that surfaced in the days of the Old Republic."
  },
  {
    "name": "Integrated Gear",
    "meta": "*Item modification (armor), Varies*",
    "desc": "**Basic (Standard):** This modification comes with one slot to attach one adventuring gear item to the armor. The types of adventuring gear that can be integrated are limited to the communications, data recording and storage, life support, utility, and weapon or armor accessory categories and cannot weigh more than 1 lb. Integrated equipment is constantly ready for use and no longer requires your object interaction or a free hand before being used.\n\nInstalling, removing, or replacing a single piece of integrated equipment takes 10 minutes and a DC 10 Intelligence (Tinker’s Kit) check. On a success, the item is correctly integrated. On a failure, the item is not integrated, and you must wait 24 hours before you can try again.\n\n**Fine (Premium):** This modification comes with two slots to attach one adventuring gear item to the armor per slot. The types of adventuring gear that can be integrated are limited to the communications, data recording and storage, life support, utility, and weapon or armor accessory categories and cannot weigh more than 1 lb. Integrated equipment is constantly ready for use and no longer requires your object interaction or a free hand before being used.\n\nInstalling, removing, or replacing a single piece of integrated equipment takes 10 minutes and a DC 10 Intelligence (Tinker’s Kit) check. On a success, the item is correctly integrated. On a failure, the item is not integrated, and you must wait 24 hours before you can try again. For each item already integrated, increase the DC by 1.\n\n**Improved (Prototype):** This modification comes with five slots to attach one adventuring gear item to the armor per slot. The types of adventuring gear that can be integrated are limited to the communications, data recording and storage, life support, utility, and weapon or armor accessory categories and cannot weigh more than 1 lb. Integrated equipment is constantly ready for use and no longer requires your object interaction or a free hand before being used.\n\nInstalling, removing, or replacing a single piece of integrated equipment takes 10 minutes and a DC 10 Intelligence (Tinker’s Kit) check. On a success, the item is correctly integrated. On a failure, the item is not integrated, and you must wait 24 hours before you can try again. For each item already integrated, increase the DC by 1.\n\n**Superior (Advanced):** This modification comes with ten slots to attach one adventuring gear item to the armor per slot. The types of adventuring gear that can be integrated are limited to the communications, data recording and storage, life support, utility, and weapon or armor accessory categories and cannot weigh more than 1 lb. Integrated equipment is constantly ready for use and no longer requires your object interaction or a free hand before being used.\n\nInstalling, removing, or replacing a single piece of integrated equipment takes 10 minutes and a DC 10 Intelligence (Tinker’s Kit) check. On a success, the item is correctly integrated. On a failure, the item is not integrated, and you must wait 24 hours before you can try again. For each item already integrated, increase the DC by 1."
  },
  {
    "name": "Mantle of the Force",
    "meta": "*Item modification (lightweapon), artifact*",
    "desc": "While using this item as your focus, you gain a +2 bonus to the force save DC of powers that require a Dexterity, Intelligence, Wisdom, or Charisma saving throw.\n\nThe companion crystal to the Heart of the Guardian, the Mantle of the Force is an ancient crystal that increases one's self-awareness while sharply attuning the wielder to the flow of The Force."
  },
  {
    "name": "Mod Slot Installer",
    "meta": "*Consumable (technology), Varies*",
    "desc": "**Prerequisite:** Lacks less than 2 modification slots\n\n**Basic (Standard):** Using this item you can add a modification slot to an item that lacks them. Installing a modification slot takes one hour and requires a DC 10 ability check with an appropriate tool, as shown in the Item Specific Tools table on page 74 of Wretched Hives.\n\nOn a success the item gains one modification slot for a standard rarity modification. If an item has 2 modification slots, that item requires attunement, if it didn’t already.\n\n**Fine (Premium):** Using this item you can add a modification slot an item that lacks them. Installing a modification slot takes one hour and requires a DC 14 ability check with an appropriate tool, as shown in the Item Specific Tools table on page 74 of Wretched Hives.\n\nOn a success the item gains one modification slot for a premium rarity modification. If an item has 2 modification slots, that item requires attunement, if it didn’t already."
  },
  {
    "name": "Power Recharger",
    "meta": "*Adventuring Gear (Varies), Requires Attunement by a techcaster*",
    "desc": "**MK I (Standard):** While this recharger is on your person, you can use an action to regain 2 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\n**MK II (Premium):** While this recharger is on your person, you can use an action to regain 4 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\n**MK III (Prototype):** While this recharger is on your person, you can use an action to regain 6 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\n**MK IV (Advanced):** While this recharger is on your person, you can use an action to regain 8 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, or 7th-level tech power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest.\n\n**MK V (Legendary):** While this recharger is on your person, you can use an action to regain 9 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, 7th, or 8th-level tech power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest.\n\n**MK VI (Artifact):** While this recharger is on your person, you can use an action to regain 10 tech points. Once you have used the recharger, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, 7th, 8th, or 9th-level tech power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest."
  },
  {
    "name": "Singing Stone",
    "meta": "*Adventuring Gear (Varies), Requires attunement by a Forcecaster*",
    "desc": "**Novice (Standard):**While this stone is on your person, you can use an action to regain 2 force points. Once you have used the stone, it can't be used again until the next dawn.\n\n**Apprentice (Premium):** While this stone is on your person, you can use an action to regain 4 force points. Once you have used the stone, it can't be used again until the next dawn.\n\n**Journeyman (Prototype):** While this stone is on your person, you can use an action to regain 6 force points. Once you have used the stone, it can't be used again until the next dawn.\n\n**Adept (Advanced):** While this stone is on your person, you can use an action to regain 8 force points. Once you have used the stone, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, or 7th-level force power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest.\n\n**Master (Legendary):** While this stone is on your person, you can use an action to regain 9 force points. Once you have used the stone, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, 7th, or 8th-level force power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest.\n\n**Ancient (Artifact):** While this stone is on your person, you can use an action to regain 10 force points. Once you have used the stone, it can't be used again until the next dawn.\n\nAdditionally, once within the next 10 minutes, you may cast a 4th, 5th, 6th, 7th, 8th, or 9th-level force power, ignoring your maximum casts per long rest. You can only benefit from this effect once per long rest."
  },
  {
    "name": "Thermal Detonator (Errata)",
    "meta": "*Adventuring Gear: Explosives*\n2,000 credits, 1.00 lb",
    "desc": "Thermal detonators are unique grenades that can only be disarmed by whoever armed them. In addition to being thrown or set like a grenade, they can also be paired with a remote detonator.\n\nEach creature within 20 feet must make a DC 14 Dexterity saving throw. A creature takes 2d10 fire and 2d10 kinetic damage on a failed save, or half as much as on a successful one. Additionally, on a failed save, the creature is knocked prone."
  },
  {
    "name": "Tightbeam Tranceiver",
    "meta": "*Adventuring Gear (Communication), ?*",
    "desc": "Over the course of one minute, you can attach a tightbeam transceiver to any communications category device, such as a comlink or more advanced device. Additionally, you can link two or more tightbeam transceivers together.\n\nCom scanners and other passive methods of interception cannot pick up messages between two linked devices installed with tightbeam transceivers, unless the interceptor is directly in the path between individuals using these devices."
  }
]