[
  {
    "name": "Administer Aid",
    "description": "You can expend a superiority die to tend to a creature you can touch. The creature regains a number of hit points equal to the number rolled + your maneuver ability modifier.",
    "type": "Heal",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": true,
    "effect": []
  },
  {
    "name": "Adrenaline Hit",
    "description": "You expend one superiority die to inject a creature with regenerative medication that temporarily enhances their agility. When you do so, a creature you can touch regains hit points equal to the superiority die roll. Additionally, until the start of your next turn, when that creature would take damage, the amount is reduced by an amount equal to your maneuver ability modifier.",
    "type": "Heal",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Adrenaline Hit",
        "duration": "1",
        "description": "When that creature would take damage, the amount is reduced by an amount equal to your maneuver ability modifier."
      }
    ]
  },
  {
    "name": "Assist",
    "description": "*Prerequisite: Proficiency in Medicine*\n\nWhen you make an Medicine check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Automatic Startup Sequence",
    "description": "Prerequisite: The ability to cast tech powers\n\nWhen a creature makes a saving throw against a tech power you cast, you may expend a superiority die, subtracting the number rolled from their total.",
    "type": "Roll",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Body over Bother",
    "description": "When you are forced to make an Strength, Dexterity, or Constitution saving throw, you can expend a superiority die to change the saving throw ability to your maneuver ability modifier.",
    "type": "Mod",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Call to Arms",
    "description": "*Prerequisite: Proficiency in Persuasion*\n\nIf you are surprised at the start of combat and aren’t incapacitated, you can expend one superiority die to act normally.\n\n**Improved**\nWhen you use your Call to Arms maneuver, you can roll the superiority die and extend the benefits of the maneuver to a number of allies up to the result of the roll, provided those allies can see or hear you.",
    "type": "Effect",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Calling Card",
    "description": "You can expend a superiority die to throw a sonic charge at a target you can see within 30 feet. When you do so, the target and each creature of your choice within 5 feet of it must make Dexterity saving throws, taking sonic damage on a failure. The sonic damage equals the number rolled on the superiority die.",
    "type": "Damage",
    "d_type": "Sonic",
    "sub": "Physical",
    "save": "Dexterity",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Charge",
    "description": "*Prerequisite: Proficiency in Persuasion*\n\nyou can expend one superiority die to spur your allies to move. Until the start of your next turn, creatures you choose within 10 feet of you who can see or hear you can move an additional distance equal to 5 times the superiority die rolled on their turn and ignore unenhanced difficult terrain.",
    "type": "Roll",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Charge",
        "duration": "1",
        "description": "Move an additional distance equal to 5 times the superiority die rolled on their turn and ignore unenhanced difficult terrain."
      }
    ]
  },
  {
    "name": "Charging Attack",
    "description": "If you move at least 10 feet towards your target before successfully hitting them with a melee attack, you may expend a superiority die, causing the target to take additional damage equal to the result, and forcing it to make a Strength saving throw. On a failed save the creature is knocked prone.",
    "type": "Add_Damage",
    "d_type": "",
    "sub": "Physical",
    "save": "Strength",
    "apply_mod": false,
    "effect": [
      {
        "name": "Prone",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Charming Presence",
    "description": "*Prerequisite: Proficiency in Charisma*\n\nYou can make a Charisma (Persuasion) check and expend one superiority die to attempt to charm a humanoid creature who can see or hear you within 60 feet. Add the superiority die to the roll. The target makes a contested Wisdom (Insight) check. If your check succeeds, the target is charmed by you until the end of your next turn.",
    "type": "Check",
    "c_type": "Persuasion",
    "d_type": "",
    "sub": "Mental",
    "save": "Wisdom",
    "apply_mod": false,
    "effect": [
      {
        "name": "Charmed",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Commander's Strike",
    "description": "You direct one of your companions to strike. When you do so, choose a friendly creature who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding the superiority die to the attack’s damage roll.",
    "type": "Roll",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Conceal",
    "description": "*Prerequisite: Proficiency in Steal*\n\nWhen you make an Stealth check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Crippling Blow",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to cripple the creature. You add the superiority die to the attack’s damage roll and the creature’s gains 1 slowed level until the end of their next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Slowed",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Daring Escape",
    "description": "You can expend one superiority die to take the Disengage action as a bonus action on your turn. Until the end of this turn, you have advantage on ability checks and saving throws to break effects that would grapple, restrain or slow you.",
    "type": "Effect",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Disengaged",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Dark Transference",
    "description": "When you hit a creature with an attack, you can expend a superiority die and roll it to attempt to siphon life from it. The target must make a Constitution saving throw. On a failed save, add the result to the damage roll, and you regain one expended Hit Die.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "Constitution",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Deathseek",
    "description": "When an attack made against a hostile creature that you can see would miss, you can use a reaction and expend a superiority die and roll it to force the creature to instead take the hit. The creature must make a Wisdom saving throw. On a failed save, the target takes the minimum damage the attack could have dealt plus additional damage equal to the result of the superiority die.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "Wisdom",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Deceive",
    "description": "*Prerequisite: Proficiency in Deception*\n\nWhen you make an Deception check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Deliberate Movement",
    "description": "You can expend one superiority die to take the Dash action as a bonus action and ignore the effects of unenhanced difficult terrain until the end of your turn.",
    "type": "Effect",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Disarming Blow",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it’s holding. You add the superiority die to the attack’s damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. If you have a free hand and are within 5 feet of the creature, you can catch the item. Otherwise, the object lands at the creature’s feet.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Physical",
    "save": "Strength",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Distracting Blow",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack’s damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Distracting Blow",
        "duration": "1",
        "description": "The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn."
      }
    ]
  },
  {
    "name": "Effective Flanking",
    "description": "As a bonus action, you choose a target within 30 feet that you can see to make a Wisdom saving throw. On a failed save, roll a superiority die; the result is added to the first attack roll against the creature before the start of your next turn.\n\n**Improved**\nWhen you use the Effective Flanking maneuver, you add the result of the superiority die to both the attack and damage roll for the first attack against the creature before the start of your next turn.\n\n**Greater**\nWhen you use the Effective Flanking maneuver, you add your maneuver ability modifier to both the attack and damage roll for the first attack against the creature before the start of your next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": true,
    "effect": []
  },
  {
    "name": "Empathize",
    "description": "*Prerequisite: Proficiency in Insight*\n\nWhen you make an Insight check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Encouraging Pace",
    "description": "You can use a bonus action to expend and roll a superiority die. When you do so, a number of friendly creatures equal to your maneuver ability modifier can immediately use their reaction to move a number of feet equal to 5 times the number rolled on the superiority die.",
    "type": "Mod",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Encouraging Speech",
    "description": "*Prerequisite: Proficiency in Persuastion*\n\nYou can expend a superiority die to give an encouraging speech, spending the next minute rallying your allies. You grant two allies temporary hit points equal to the amount rolled on the superiority die + your maneuver ability modifier.\n\nThis increases to three allies at 5th level, four allies at 9th level, five allies at 13th level, and six allies at 17th level.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": true,
    "effect": []
  },
  {
    "name": "Enhancement Injection",
    "description": "*Prerequisite: Proficiency in Medicine*\n\nAs an action, you can expend one superiority die to inject a creature you can touch with enhancements, granting them temporary hit points equal to the superiority die roll + your maneuver ability modifier, which last for 1 minute. Additionally, when the target makes a Strength or Constitution check or saving throw while it has these temporary hit points, it gains a bonus equal to your maneuver ability modifier.",
    "type": "T_Heal",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": true,
    "effect": [
      {
        "name": "Enhancement Injection",
        "duration": "10",
        "description": "Grants temp HP. Additionally, when the target makes a Strength or Constitution check or saving throw while it has these temporary hit points, it gains a bonus equal to your maneuver ability modifier."
      }
    ]
  },
  {
    "name": "Evasive Footwork",
    "description": "When you move, you can expend one superiority die, rolling the die and adding the number rolled to your AC until you stop moving.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Exploit Weakness",
    "description": "When you hit a creature with a weapon attack, you can expend a superiority die and deal additional true damage equal to the number rolled.",
    "type": "Damage",
    "c_type": "",
    "d_type": "True",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Fast Access Programs",
    "description": "*Prerequisite: The ability to cast tech powers*\n\nWhen you cast a tech power of 1st-level or higher that has a casting time of 1 action, you can expend a superiority die to change the casting time to 1 bonus action for this casting.",
    "type": "Effect",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Feinting Attack",
    "description": "You can expend one superiority die and use a bonus action on your turn to feint, choosing one creature within 5 feet of you as your target. You have advantage on your next attack roll against that creature this turn. If that attack hits, add the superiority die to the attack’s damage roll.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Firewall",
    "description": "*Prerequisite: the ability to cast tech power*\n\nWhen you or an ally you can see within 60 feet make a saving throw against a tech power, you can use your reaction to expend a superiority die, adding the number rolled to the result of that saving throw.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Flex",
    "description": "*Prerequisite: Proficiency in Athletics*\n\nWhen you make an Athletics check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Flourish",
    "description": "*Prerequisite: Proficiency in Sleight of Hand*\n\nWhen you make an Sleight of Hand check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Force Resonance",
    "description": "*Prerequisite: The ability to cast force powers*\n\nImmediately after you deal damage to a target with a force attack, you can expend a superiority die and target a second creature that you can see within 30 feet of the first creature. Roll the die, and the second creature takes force damage equal to the roll + your forcecasting modifier.",
    "type": "Damage",
    "c_type": "",
    "d_type": "Force",
    "sub": "Mental",
    "save": "",
    "apply_mod": true,
    "effect": []
  },
  {
    "name": "Fortune and Glory",
    "description": "*Prerequisite: The ability to cast force powers*\n\nWhen you would make a weapon attack against a target within 30 feet, you can instead manipulate the Force to expend a superiority die and make a Sleight of Hand check using your universal forcecasting ability to plant something on the target, conceal an object on the target, lift the target’s purse, or take something from its pocket. Roll the superiority die, and add the result to the check",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Goading Attack",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to attempt to goad the target into attacking you. You add the superiority die to the attack’s damage roll, and the target must make a Wisdom saving throw. On a failed save, the target has disadvantage on all attack rolls against targets other than you until the end of your next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "Wisdom",
    "apply_mod": false,
    "effect": [
      {
        "name": "Goading Attack",
        "duration": "1",
        "description": "The target has disadvantage on all attack rolls against targets other than"
      }
    ]
  },
  {
    "name": "Hacked Communications",
    "description": "*Prerequisite: Proficiency in Technology*\n\nAs an action, you may expend a superiority die, and choose any number of creatures that you can see within 60 feet of you that have commlinks, headcomms, or other such communications devices. Each creature must succeed on a Constitution saving throw or take sonic damage equal to the number rolled on the dice + your maneuver ability modifier (minimum of one). Additionally, on a failed save, their communication devices are disabled until rebooted.",
    "type": "Damage",
    "c_type": "",
    "d_type": "Sonic",
    "sub": "Mental",
    "save": "Constitution",
    "apply_mod": false,
    "effect": [
      {
        "name": "Hacked Communications",
        "duration": "",
        "description": "Communication devices are disabled until rebooted"
      }
    ]
  },
  {
    "name": "Handle Animal",
    "description": "*Prerequisite: Proficiency in Animal Handling*\n\nWhen you make an Animal Handling check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Heads Up",
    "description": "When a friendly creature who can see or hear you makes a saving throw, you can use your reaction and expend a superiority die, adding the number rolled to the result of the saving throw.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Incite",
    "description": "*Prerequisite: Proficiency in Persuasion*\n\nOn your turn, you can use an action and expend one superiority die to bolster the resolve of one of an ally within 30 feet who can see or hear you. The ally can add your maneuver ability modifier to every damage roll they make until the start of your next turn.",
    "type": "Mod",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Incite",
        "duration": "1",
        "description": "Add the maneuver ability modifier to every damage roll they make until the start of your next turn"
      }
    ]
  },
  {
    "name": "Inner Strength",
    "description": "As an action, you can expend and roll one superiority die, gaining temporary hit points equal to the result of the roll + your maneuver ability modifier.",
    "type": "T_Heal",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": true,
    "effect": []
  },
  {
    "name": "Intimidating Presence",
    "description": "*Prerequisite: Proficiency in Intimidation*\n\nAs an action, you can make a Charisma (Intimidation) check and expend one superiority die to attempt to frighten a humanoid creature who can see or hear you within 60 feet. Add the superiority die to the roll. The target makes a contested Wisdom (Insight) check. If your check succeeds, the target is frightened of you until the end of your next turn.",
    "type": "Check",
    "c_type": "Charisma",
    "d_type": "",
    "sub": "Mental",
    "save": "Wisdom",
    "apply_mod": false,
    "effect": [
      {
        "name": "Frightened",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Investigate",
    "description": "*Prerequisite: Proficiency in Investigation*\n\nWhen you make an Investigation check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Lunging Attack",
    "description": "When you make a melee weapon attack on your turn, you can expend one superiority die to increase your reach for that attack by 5 feet. If you hit, you add the superiority die to the attack’s damage roll.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Maneuvering Attack",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to maneuver one of your comrades into a more advantageous position. You add the superiority die to the attack’s damage roll, and you choose a friendly creature who can see or hear you.\n\nThat creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Menacing Attack",
    "description": "When you hit a creature with a weapon attack, you can expend one superiority die to attempt to frighten the target. You add the superiority die to the attack’s damage roll, and the target must make a Wisdom saving throw. On a failed save, it is frightened of you until the end of your next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "Wisdom",
    "apply_mod": false,
    "effect": [
      {
        "name": "Frightened",
        "duration": "1",
        "description": ""
      }
    ]
  },
  {
    "name": "Mind Over Matter",
    "description": "When you are forced to make an Intelligence, Wisdom, or Charisma saving throw, you can expend a superiority die to change the saving throw ability to your maneuver ability modifier.",
    "type": "Mod",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Neutralize",
    "description": "*Prerequisite: Proficiency in Nature*\n\nWhen you make an Nature check, you can expend a superiority die, rolling the die and adding it to the d20 roll. You can wait until after rolling the d20 before doing so, but you must decide before the GM says whether the roll succeeds or fails.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Neuroblock",
    "description": "*Prerequisite: Proficiency in Medicine*\n\nWhen you make an attack roll, you can expend a superiority die and add it to the attack roll. On a hit, the creature’s next attack has disadvantage and it cannot regain hit points until the start of your next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "No Escape",
    "description": "Whenever you or an ally you can see makes an opportunity attack, you can expend a superiority die. If the attack hits, roll the superiority die and add the result to the damage roll. Additionally, the affected creature gains 4 slowed levels until the start of its next turn.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "One Step Ahead",
    "description": "When you roll initiative and you are not surprised, you can expend a superiority die and add the number rolled to your Initiative check.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Physical",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "One With Shadows",
    "description": "*Prerequisite: Proficiency in Stealth*\n\nWhen you are in an area of dim light or darkness, you can use your action and expend one superiority die to become invisible until you move or take a hostile action.",
    "type": "Effect",
    "c_type": "",
    "d_type": "",
    "sub": "General",
    "save": "",
    "apply_mod": false,
    "effect": [
      {
        "name": "Invisible",
        "duration": "",
        "description": "Invisible until you move or take a hostile action."
      }
    ]
  },
  {
    "name": "One with the Force",
    "description": "*Prerequisite: The ability to cast force powers*\n\nOnce per turn, when you make a Constitution saving throw to maintain concentration on a force power, you can expend a superiority die and add the number rolled to the saving throw.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  },
  {
    "name": "Overcapacity Powers",
    "description": "*Prerequisite: The ability to cast tech powers*\n\nWhen you cast a tech power of 1st-level or higher, you may expend a superiority die to cast the power at a higher level, provided it does not exceed your Maximum Power Level. Roll the superiority die, and add it to the level at which you are casting the power. You can choose to cast it at this new power level or lower.",
    "type": "Roll",
    "c_type": "",
    "d_type": "",
    "sub": "Mental",
    "save": "",
    "apply_mod": false,
    "effect": []
  }
]
